#+BEGIN_EXPORT html
---
layout: page
title: General Data Structures
tagline: " overview"
permalink: /fundamentals/data-structures-overview.html
categories: [Data Structuries, Fundamentals]
tags: [python, data structuries, dictionaries]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+TOC: headlines 2

** Arrays

#+begin_quote
/Array/ is a linear data structure that stores a collection of items
of same data type in contiguous memory locations.
#+end_quote

/Linear data structures/ are a type of data structure in computer
science where data elements are arranged sequentially or
linearly. Each element has a previous and next adjacent, except for
the first and last elements.


#+begin_example
A real-world analogy for an array data structure is a parking lot. You
can look at the parking lot as a whole and treat it as a single
object, but inside the lot there are parking spots indexed by a unique
number. Parking spots are containers for vehicles—each parking spot
can either be empty or have a car, a motorbike, or some other vehicle
parked on it.
#+end_example

/Array index/: In an array, elements are identified by their
indexes. Array index starts from 0.

/Array element/: Elements are items stored in an array and can be
accessed by their index.

/Array Length/: The length of an array is determined by the number of
elements it can contain.

#+begin_src python
  # Find The Lowest Value in an Array
  my_array = [5, 11, 8, 3, 12]
  minVal = my_array[0]
  for i in my_array:
      if i < minVal:
          minVal = i
  print('Lowest value: ',minVal)

#+end_src

#+RESULTS:
: Lowest value:  3

